# Дано положительное действительное число. Выведите его дробную часть.

number1 = float(input())
number2 = int(number1)

print(number1-number2)

