# Две старушки идут навстречу друг другу с постоянными скоростями V1 и V2 км/ч.
# Определите, через какое время (в часах) старушки встретятся, если расстояние между ними равно S км
# Программа должна вывести одно число в соответствии с условием задачи

rasstojanie = float(input())
v1 = float(input())
v2 = float(input())

time = (rasstojanie / (v1 + v2))

print(time)

