# На вход программе подаётся последовательность целых чисел от 1 до 5, характеризующее оценку ученика,
# каждое число на отдельной строке.
# Концом последовательности является любое неположительное число либо число, большее 5.
# Программа выводит количество пятерок.

num = int(input())
cnt = 0

while num <= 5 and (num > 0):
    if num == 5:
        cnt += 1
    num = int(input())
print(cnt)
