# Всем известно, что ведьмак способен одолеть любых чудовищ, однако его услуги обойдутся недешево.
# К тому же ведьмак не принимает купюры, он принимает только чеканные монеты.
# В мире ведьмака существуют монеты с номиналами 1,5,10,25.
# Программа определяет, какое минимальное количество чеканных монет нужно заплатить ведьмаку.

num = int(input())
cnt = 0

while num - 25 >= 0:
    num = num - 25
    cnt += 1
while num - 10 >= 0:
    num = num - 10
    cnt += 1
while num - 5 >= 0:
    num = num - 5
    cnt += 1
while num - 1 >= 0:
    num = num - 1
    cnt += 1
print(cnt)
