# На вход программе подаётся последовательность слов, каждое слово на отдельной строке.
# Концом последовательности является слово «КОНЕЦ» (без кавычек).
# При этом само слово «КОНЕЦ» не входит в последовательность, лишь символизируя её окончание.
# Программа выводит члены данной последовательности.

text = input()

while text != 'КОНЕЦ':
    print(text)
    text = input()
