#        Оператор	               Описание
#           ()	                    Скобки
#           **	             Возведение в степень
#   - (унарный минус)	         Унарный минус
#       *, /, //, %	         Умножение, деление, целочисленное деление, остаток от деления
#          +, -	              Сложение, вычитание

# (-10**2)
# print(-10**2) ≠ -10 * -10 потому что, операция возведения выше по приоритету.
# То есть python сначала возводит, а затем добавляет минус к итоговому значению.

print(-10**2)
print(-10**3)

# ((-10)**2)
# скобки закрепляют минус к числу — это действие в приоритете, а потом идет возведение в степень.
# То есть python сначала добавляет минус к числу, а затем возводит его в степень.

print((-10)**2)
print((-10)**3)

# (3**1**2)
# Порядок операторов возведения в степень применяется справа налево
# То есть python сначала возводит 1 в степень 2, 3 возводит в получившуюся степень.

print(3**1**2)