# (9 // 12) и (9 % 12)
# представьте, что у нас есть пустой кувшин объёмом 9 л и полные бутылки с водой, каждая объёмом 12 л.
# И когда мы пытаемся сделать 9 // 12 мы на самом деле пытаемся понять, сколько целых бутылок можно влить в кувшин.
# Т.к. объём нашей бутылки 12 л, то мы не сможем нисколько целых бутылок влить в кувшин.
# У нас просто объём кувшина не такой большой, он не сможет вместить в себя объём ни одной целой бутылки с водой,
# значит, 9 // 12 = 0
# А когда мы пытаемся сделать 9 % 12, мы на самом деле пытаемся понять, сколько литров кувшина останется незанятым,
# если мы попытаемся влить туда целые бутылки. Т.к. ни одной целой бутылки в кувшин мы влить не сможем,
# то кувшин будет пустой, значит, 9 л кувшина будет незанятым, значит 9 % 12 = 9

print(-123 // 10)
print(6 % 3)

# a = 7
# (16 % 7) = 2
# В кувшин объемом 16 литров поместятся 2 целые бутылки по 7 л + еще 2 литра останется
# 15 // 2 = 7
# В кувшин объемом 15 литров поместится 7 целых бутылок объемом 2 л

# b = -8
# Табличка с приоритетами в файле priorities.py. Операторы % и * одного приоритета
# 1) выполняем 34 % a, затем умножаем это на 5
# В кувшин объемом 34 литра поместятся 4 целые бутылки по 7 л + еще 6 литров останется
# И умножаем 6 на 5 = 30
# 2) выполняем 29 % 5, затем умножаем это на 5
# В кувшин объемом 29 литров поместятся 5 целых бутылок по 5 л + еще 4 литра останется
# И умножаем 4 на 2 = 8
# 1) - 2) 30 - 8 = 22

# а + b = 7 + 22 = 29

a = 15 // (16 % 7)
b = 34 % a * 5 - 29 % 5 * 2
print(a + b)

# Табличка с приоритетами в файле priorities.py.
# 3 ** 2 = 9
# Операторы % и // одного приоритета
# 82 // 9 = 9
# В кувшин объемом 82 литра поместятся 9 целых бутылок
# 9 % 7 = 2
# В кувшин объемом 9 литров поместится 1 целая бутылка по 7 л + еще 2 литра останется
# a = 2

a = 82 // 3**2 % 7
print(a)


