# На обработку поступает последовательность из 10 целых чисел (каждое на отдельной строке).
# Известно, что вводимые числа по абсолютной величине не превышают 10^6
# Программа выводит на экран сумму всех отрицательных чисел последовательности
# и максимальное отрицательное число в последовательности.
# Если отрицательных чисел нет, требуется вывести на экран «NO» (без кавычек).

sum_x = 0
max_x = -10**6 - 1
flag = True

for i in range(1, 11):
    x = int(input())
    if x < 0:
        sum_x += x
        if x > max_x:
            max_x = x

if max_x == -10**6 - 1:
    print("NO")
else:
    print(sum_x)
    print(max_x)



