# Назовём число интересным, если в нём разность максимальной и минимальной цифры равняется средней по величине цифре.
# Программа, которая определяет, интересное число или нет.
# Если число интересное, следует вывести «Число интересное», иначе – «Число неинтересное»..

num = int(input())

a = num % 10
b = (num // 10) % 10
c = (num // 100) % 10

f = max(a, b, c)
g = min(a, b, c)
if b < a < c or c < a < b or a == b or a == c:
    e = a
elif a < b < c or c < b < a or b == a or b == c:
    e = b
elif a < c < b or b < c < a or c == a or c == b:
    e = c

if f - g == e:
    print('Число интересное')
else:
    print('Число неинтересное')


