# Напишите программу, которая находит наименьшее и наибольшее из пяти чисел.

a = int(input())
b = int(input())
c = int(input())
d = int(input())
e = int(input())

f = max(a, b, c, d, e)
g = min(a, b, c, d, e)

print ('Наименьшее число =', g)
print ('Наибольшее число =', f)


