# На вход программе подаётся число n(n>1). Программа, которая выводит его наименьший отличный от 1 делитель.

n = int(input())
for i in range(2, n + 1):  # Начинаем с 2, так как ищем делитель, отличный от 1
    if n % i == 0:  # Проверяем, является ли i делителем n
        print(i)
        break  # Выходим из цикла после нахождения первого делителя




