#  Программа, которая считывает с клавиатуры два целых числа и строку.
#  Если эта строка является обозначением одной из четырёх математических операций (+, -, *, /),
#  то выводится результат применения этой операции к введённым ранее числам,
#  в противном случае выводится «Неверная операция» (без кавычек).
#  Если пользователь захочет поделить на ноль, выводится текст «На ноль делить нельзя!» (без кавычек)..

a = int(input())
b = int(input())
c = input()

if c == "+":
    print(a+b)
elif c == "-":
    print(a-b)
elif c == "*":
    print(a*b)
elif c == "/" and b != 0:
    print(a/b)
elif c == "/" and b == 0:
    print("На ноль делить нельзя!")
else:
    print('Неверная операция')


