# Зум бросил вызов Флэшу и предложил ему честный поединок в виде гонки вокруг магнетара.
# В случае проигрыша эта нейтронная звезда зарядится и уничтожит мир,
# поэтому Флэш решил не рисковать без причины и узнать у своего друга Циско Рамона, есть ли смысл принимать вызов.
# Циско получил данные, что скорость Зума равна n, а скорость Флэша равна k
# Программа, которая должна вывести ответ Циско на вопрос Флэша.
# Если Зум быстрее Флэша, нужно вывести «NO», а если Флэш быстрее Зума, нужно вывести «YES».
# В случае же если их скорости равны, нужно вывести «Don't know».

k, n = int(input()), int(input())

if n > k:
    print('YES')
elif k > n:
    print('NO')
else:
    print("Don't know")


