# Известен вес боксера-любителя (целое число). Известно, что вес таков, что боксер может быть отнесён к одной из трех весовых категорий:
# Легкий вес – до 60 кг (невключительно);
# Первый полусредний вес – до 64 кг (невключительно);
# Полусредний вес – до 69 кг (невключительно).
# Программа, определяющая, в какой категории будет выступать данный боксер..

a = int(input())

if 60 > a > 0:
    print('Легкий вес')
elif 64 > a >= 60:
    print('Первый полусредний вес')
elif 69 > a >= 64:
    print('Полусредний вес')


