# Цифровым корнем числа n называется число, получающееся следующим образом: вычисляется сумма цифр числа
# n, затем сумма цифр у получившегося числа и так далее, пока не получится однозначное число.
# Например, цифровой корень числа 9875 равен 2
# На вход программе подаётся натуральное число n. Программа находит цифровой корень данного числа

n = int(input("Введите натуральное число: "))

while n >= 10:  # Пока число не станет однозначным
    sum_of_digits = 0
    while n > 0:  # Суммируем цифры числа
        sum_of_digits += n % 10  # Добавляем последнюю цифру
        n = n // 10  # Убираем последнюю цифру

    number = sum_of_digits  # Переходим к сумме цифр

print(number)




