# Даны два целых числа m и n.
# Программа, которая выводит все целые числа от m до n включительно в порядке возрастания, если m<n,
# или в порядке убывания в противном случае

m = int(input())
n = int(input())

if m<n:
    for i in range(m, n+1):
        print(i)
else:
    for i in range(m, n-1, -1):
        print(i)




