# Даны два целых числа m и n (m≤n).
# Программу, которая выводит все целые числа от m до n включительно

m = int(input())
n = int(input())

for i in range(m, n+1):
    print(i)




