# Даны две различные клетки шахматной доски. Напишите программу, которая определяет,
# может ли король попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8
# каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
# Программа должна вывести «YES», если из первой клетки ходом короля можно попасть во вторую, или «NO» в противном случае.

x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())

if  (1 <= x1 <= 8 and 1 <= y1 <= 8 and 1 <= x2 <= 8 and 1 <= y2 <= 8
    and ((x2 == x1 + 1 or (x2 == x1 - 1) or (x2 == x1)) and (y2 == y1 + 1 or (y2 == y1 - 1) or (y2 == y1)))):
    print('YES')
else: print ('NO')


